app/views/albums/show.html.erb

<hr>
<% unless @album.photos.blank? %>
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` = 1