app/controllers/albums_controller.rb

INSERT INTO `albums` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('dsasdd', 1, '2019-03-20 05:25:53', '2019-03-20 05:25:53')
---
	def create
	  @album = current_user.albums.new(album_params)
	  @album.save

SELECT  `albums`.* FROM `albums` WHERE `albums`.`id` = 2 LIMIT 1
---
	def show
    @album = Album.find(params[:id])

SELECT  `albums`.* FROM `albums` WHERE `albums`.`id` = 1 LIMIT 1
DELETE FROM `albums` WHERE `albums`.`id` = 1
---
	def destroy
    @album = Album.find(params[:id])
    @album.destroy