app/controllers/welcome_controller.rb

SELECT `photos`.* FROM `photos` WHERE `photos`.`id` IN (NULL, NULL)
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)
---
  def index
  	@photos = Photo.all.includes(album: :user).last(25).reverse